const freelancerName = "Yossi";
const income = 150000; // ההכנסה השנתית
let tax = 0; // קופת המס שהוא יצטרך לשלם

if (income <= 23000) {
    // מדרגה 1: מרוויח קצת, משלם רק 10% על מה שהרוויח
    tax = income * 0.10;
    
} else if (income <= 46000) {
    // מדרגה 2 (עד 46 אלף)
    // משלם 10% על ה-23 הראשונים + 20% על מה שמעל ה-23
    tax = (23000 * 0.10) + ((income - 23000) * 0.20);
    
} else if (income <= 120000) {
    // מדרגה 3 (עד 120 אלף)
    // מדרגה 1 מלאה + מדרגה 2 מלאה + 30% על מה שמעל 46
    tax = (23000 * 0.10) + (23000 * 0.20) + ((income - 46000) * 0.30);
    
} else if (income <= 220000) {
    // מדרגה 4 (עד 220 אלף)
    tax = (23000 * 0.10) + (23000 * 0.20) + (74000 * 0.30) + ((income - 120000) * 0.40);
    
} else {
    // המדרגה העליונה (מעל 220 אלף)
    // משלם את כל המדרגות הקודמות במלואן + 50% על כל שקל מעל 220 אלף
    tax = (23000 * 0.10) + (23000 * 0.20) + (74000 * 0.30) + (100000 * 0.40) + ((income - 220000) * 0.50);
}

console.log(freelancerName + " owes " + tax + " NIS in taxes.");

